import sqlite3
from database import init_db, DB_NAME

def main():
    init_db()

    students = [
    "Алексеева Татьяна",
    "Бамбаев Алтан",
    "Буторов Иван",
    "Быков Илья",
    "Ганзий Владислав",
    "Голуб Дмитрий",
    "Дьяченко Максим",
    "Еланская Екатерина",
    "Исламов Эмин",
    "Колонтаев Алексей",
    "Концевой Даниил",
    "Копылов Леонид",
    "Костиль Антон",
    "Коюшев Максим",
    "Мещеряков Кирилл",
    "Митохин Илья",
    "Орлов Даниил",
    "Павлов Сергей",
    "Пахомов Никита",
    "Петунин Алексей",
    "Подвалов Олег",
    "Принзин Кирилл",
    "Приуполин Артём",
    "Рябова Екатерина",
    "Садовникова Евгения",
    "Сидоренко Егор",
    "Старков Дмитрий",
    "Трухина Анастасия",
    "Черсков Никита",
    "Эрендженов Арслан",
    "Юлдашев Всеволод",
    "Яблоков Александр",
    "Ященко Максим",
]
    with sqlite3.connect(DB_NAME) as conn:
        cursor = conn.cursor()
        cursor.execute("DELETE FROM students") 
        for name in students:
            cursor.execute(
                "INSERT INTO students (name, weight, active) VALUES (?, 1.0, 1)",
                (name,)
            )
        conn.commit()
    print("База данных успешно заполнена.")


if __name__ == "__main__":
    main()